* Maximum number of unknowns
With complex rules, throws 1-9.

| rows | cols | max unknowns | unknown ration | tries  |
|------+------+--------------+----------------+--------|
|    2 |    3 |            3 |                | 5/50   |
|    3 |    4 |            7 |     0.58333333 | 213/50 |
|    4 |    5 |           12 |            0.6 | 134/50 |
|    5 |    6 |           19 |     0.63333333 | 214/50 |
|    6 |    7 |           27 |     0.64285714 | 10/50  |
|    7 |    8 |           36 |     0.64285714 | 35/50  |
|    8 |    9 |           46 |          0.625 | 126/50 |
|    9 |   10 |           57 |     0.62222222 | 1/50   |
#+TBLFM: $4=$3/($1*$2)
* Puzzles
All these puzzles use complex rules.  Allowed throws are 1 to 9,
unless otherwise noted.
** 2x3
*** Puzzle
|6|.|.|
|.|8|6|
*** Solution
|6|4|2|
|4|8|6|
** 3x4
*** Puzzle
|.|4|8|.|
|.|8|.|4|
|7|.|.|.|
*** Solution
|7|4|8|9|
|4|8|8|4|
|7|9|2|2|
** 3x4 --- 0-f
*** Puzzle
|7|.|.|5|
|.|3|8|6|
|0|4|8|.|
*** Solution
|7|5|b|5|
|b|3|8|6|
|0|4|8|4|
** 4x5
*** Puzzle
|.|3|.|.|.|
|9|.|.|4|4|
|2|.|.|8|.|
|.|3|6|.|.|
*** Solution
|3|3|3|4|2|
|9|4|9|4|4|
|2|2|2|8|1|
|2|3|6|8|1|
** 5x6
*** Puzzle
|2|.|3|1|5|.|
|.|.|1|8|.|.|
|.|7|.|3|.|.|
|.|.|.|.|5|.|
|.|.|.|.|5|8|
*** Solution
|2|5|3|1|5|8|
|7|5|1|8|6|9|
|4|7|9|3|9|4|
|7|9|6|9|5|6|
|5|9|6|9|5|8|
** 6x7
*** Puzzle
|.|5|.|.|.|2|.|
|2|6|.|3|.|.|.|
|2|2|.|.|.|.|.|
|4|.|6|.|9|9|.|
|8|.|.|.|.|.|8|
|.|.|.|.|5|8|.|
*** Solution
|5|5|6|6|7|2|4|
|2|6|1|3|7|3|6|
|2|2|9|9|9|9|9|
|4|9|6|6|9|9|6|
|8|5|9|9|5|5|8|
|3|3|5|9|5|8|9|
** 6x7 --- 1-5
*** Puzzle
|.|.|.|.|5|5|.|
|.|.|.|.|.|.|.|
|.|.|.|.|.|1|.|
|.|2|.|.|.|.|.|
|2|.|.|.|.|.|.|
|.|.|.|.|.|.|1|
*** Solution
|1|4|5|3|5|5|5|
|4|5|3|4|5|5|2|
|1|1|1|4|1|1|5|
|1|2|3|1|5|1|1|
|2|3|3|3|3|3|4|
|3|3|3|3|5|3|1|
** 6x7 --- 0-f
*** Puzzle
|.|a|d|.|.|5|.|
|5|.|.|.|c|f|b|
|9|.|4|.|7|c|2|
|d|9|c|2|.|a|.|
|.|5|c|.|0|.|a|
|8|3|.|a|.|4|.|
*** Solution
|9|a|d|2|2|5|f|
|5|a|d|b|c|f|b|
|9|b|4|b|7|c|2|
|d|9|c|2|e|a|a|
|a|5|c|c|0|e|a|
|8|3|c|a|d|4|6|
** 6x7 --- 0-z
*** Puzzle
|3|j|q|1|.|.|2|
|6|z|.|.|y|d|y|
|m|8|8|2|u|2|.|
|.|q|k|b|m|y|4|
|y|.|r|z|t|2|h|
|.|.|a|c|d|g|j|
*** Solution
|3|j|q|1|m|b|2|
|6|z|z|b|y|d|y|
|m|8|8|2|u|2|q|
|2|q|k|b|m|y|4|
|y|h|r|z|t|2|h|
|n|x|a|c|d|g|j|
** 7x8
*** Puzzle
|.|1|1|.|.|.|.|5|
|7|.|2|8|.|.|.|2|
|.|5|.|.|.|.|.|.|
|.|.|.|1|3|4|.|4|
|7|.|.|.|.|.|.|.|
|.|.|.|7|5|3|5|8|
|.|.|5|.|.|.|.|9|
*** Solution
|7|1|1|6|4|9|7|5|
|7|5|2|8|4|5|7|2|
|4|5|5|6|7|8|4|9|
|2|7|3|1|3|4|8|4|
|7|1|1|6|4|8|8|5|
|4|4|4|7|5|3|5|8|
|4|5|5|8|1|5|3|9|
** 8x9
*** Puzzle
|4|.|5|.|.|.|.|5|.|
|9|2|.|2|.|.|.|6|.|
|.|.|.|.|3|.|4|1|6|
|.|1|1|.|4|.|.|.|2|
|3|.|.|.|.|.|5|.|.|
|.|.|.|.|.|6|.|7|.|
|.|4|.|1|.|.|4|.|.|
|.|7|8|6|.|.|.|.|3|
*** Solution
|4|9|5|6|4|1|8|5|3|
|9|2|9|2|2|3|4|6|8|
|3|3|4|6|3|6|4|1|6|
|6|1|1|6|4|2|8|6|2|
|3|4|4|6|6|3|5|6|8|
|9|2|4|7|3|6|7|7|9|
|2|4|5|1|8|4|4|8|9|
|4|7|8|6|2|7|8|9|3|
** 9x10
*** Puzzle
|.|.|8|3|.|8|.|5|.|.|
|.|.|3|.|8|.|.|1|6|7|
|.|2|.|4|.|7|8|.|.|.|
|.|.|.|2|.|.|1|3|.|9|
|8|.|.|.|9|.|.|.|.|1|
|.|3|6|.|.|.|.|.|.|1|
|5|5|.|.|.|.|2|7|.|.|
|7|.|9|.|.|.|.|.|5|.|
|.|6|.|.|.|6|4|.|.|.|
*** Solution
|4|7|8|3|3|8|9|5|1|2|
|9|2|3|8|8|2|4|1|6|7|
|5|2|8|4|5|7|8|1|3|7|
|6|3|9|2|8|4|1|3|5|9|
|8|5|2|9|9|2|3|4|7|1|
|1|3|6|6|1|8|1|5|8|1|
|5|5|8|4|8|4|2|7|3|4|
|7|3|9|9|1|4|4|9|5|9|
|9|6|1|9|2|6|4|1|7|5|
